#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]
module.frontend.aws_s3_bucket_object.frontend["precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js"]: Refreshing state... [id=precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js]
module.frontend.aws_s3_bucket_object.frontend["robots.txt"]: Refreshing state... [id=robots.txt]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_object.frontend["index.html"]: Refreshing state... [id=index.html]
module.frontend.aws_s3_bucket_object.frontend["service-worker.js"]: Refreshing state... [id=service-worker.js]
module.frontend.aws_s3_bucket_object.frontend["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.frontend.aws_s3_bucket_object.frontend["manifest.json"]: Refreshing state... [id=manifest.json]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.aws_cloudfront_distribution.s3_distribution has changed
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ default_root_object            = "index.html" -> "public/index.html"
      ~ etag                           = "ER3C4DU5XKEKA" -> "E1BC4ZVQQTW49I"
        id                             = "E2QZVOHCSCH69J"
      ~ last_modified_time             = "2022-02-10 05:02:13.654 +0000 UTC" -> "2022-02-10 05:17:18.238 +0000 UTC"
      ~ status                         = "Deployed" -> "InProgress"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (16 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["favicon.ico"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "image/x-icon" -> null
      - etag               = "1ba2ae710d927f13d483fd5d1e548c9b" -> null
      - force_destroy      = false -> null
      - id                 = "favicon.ico" -> null
      - key                = "favicon.ico" -> null
      - source             = "frontend/../../frontend/dist/favicon.ico" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
      - version_id         = "Nh5ZpqfVBi6ARWfKVBO6hokZprQseHMx" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["index.html"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/html" -> null
      - etag               = "4a59c0b09abf7efc996f4b7344b98d41" -> null
      - force_destroy      = false -> null
      - id                 = "index.html" -> null
      - key                = "index.html" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/dist/index.html" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "kfthoVVVpUWjyJ_fO8DG1Uhl01bEgNMU" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["manifest.json"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/json" -> null
      - etag               = "4b14c64efaf846819b9a229b4193c8b7" -> null
      - force_destroy      = false -> null
      - id                 = "manifest.json" -> null
      - key                = "manifest.json" -> null
      - source             = "frontend/../../frontend/dist/manifest.json" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
      - version_id         = "TtagXlpm_f2elzp53l37UE2KfwhU5HKj" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/javascript" -> null
      - etag               = "0d295b3068ed12c42c79dc21c6e16191" -> null
      - force_destroy      = false -> null
      - id                 = "precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js" -> null
      - key                = "precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js" -> null
      - source             = "frontend/../../frontend/dist/precache-manifest.0d295b3068ed12c42c79dc21c6e16191.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
      - version_id         = "LY45jueZCcP.fLUAzcezsJRwTB2QIsqP" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["robots.txt"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/plain" -> null
      - etag               = "b6216d61c03e6ce0c9aea6ca7808f7ca" -> null
      - force_destroy      = false -> null
      - id                 = "robots.txt" -> null
      - key                = "robots.txt" -> null
      - source             = "frontend/../../frontend/dist/robots.txt" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
      - version_id         = "5sXypJDIUOk5Z55qXt9Fks_TISP4UqCc" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["service-worker.js"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/javascript" -> null
      - etag               = "e50591b433c2632313146c944f213347" -> null
      - force_destroy      = false -> null
      - id                 = "service-worker.js" -> null
      - key                = "service-worker.js" -> null
      - source             = "frontend/../../frontend/dist/service-worker.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
      - version_id         = "VY5fraV2jwrHz96OPm.3I0ppyXGKYZ_r" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 0 -> 3600
          ~ max_ttl                  = 0 -> 86400
            # (11 unchanged attributes hidden)
        }




        # (4 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend[".browserslistrc"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "cdab46f87a895f73583e23c71abfd739"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = ".browserslistrc"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/.browserslistrc"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend[".eslintrc.js"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e3b0b17193d2216f2006bc97f96cf70e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = ".eslintrc.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/.eslintrc.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend[".gitignore"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "1be540e65b34eb71fd7ae867d34e8ee0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = ".gitignore"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/.gitignore"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["README.md"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "4f860a661738739d7c10ef8eb36034f9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "README.md"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/README.md"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["babel.config.js"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "790cba154004ce8192930464c0da5d07"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "babel.config.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/babel.config.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["cypress.json"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "c6178d0870294d9085116ffc72dae005"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "cypress.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/cypress.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["package-lock.json"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "b2c653fe22ee5657b8f04ce7208b1485"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "package-lock.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/package-lock.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_object.frontend["package.json"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "579b27f48ea9907382f35e3c2099a148"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "package.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/package.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*